Core/src/src/Documents/ПлатежнаяВедомость/ПлатежнаяВедомость.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПлатежнаяВедомость</name>
  <posting>Deny</posting>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаРасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийПлатежнаяВедомость</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьГлавногоБухгалтера</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьРуководителя</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДФЛ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПФ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аванс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyПроекты</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyДокументОснование</name>
    <type>
      <types>DocumentRef.НачислениеЗарплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРасчетов</name>
    <comment>ONESOFT-3523</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДФЛПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДФЛРасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификаторВИнтернетБанке</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПФПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидУдержанияНДФЛ</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидУдержанияПФ</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидУдержания</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЛгот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <comment>ONESOFT-3849</comment>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/InformationRegisters/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Сотрудники</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаОкончанияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>ВидУдержанияНДФЛ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </resources>
  <resources>
    <name>УчастникПенсионногоФонда</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидУдержанияПФ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </resources>
  <resources>
    <name>AzRyDivision</name>
    <type>
      <types>CatalogRef.AzRyDivision</types>
    </type>
  </resources>
  <resources>
    <name>УчаствуетДобровольно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/src/Enums/ТипЛгот/ТипЛгот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипЛгот</name>
  <enumValues>
    <name>УдержаниеДляКонтрагента</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

Core/src/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Физлицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗанятости</name>
    <type>
      <types>EnumRef.ТипыЗанятости</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСПерсоналом</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСПодотчетниками</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовПоПерерасходу</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСПерсоналомРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСПодотчетникамиРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовПоПерерасходуРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВыдачиНДФЛ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетПоУмолчанию</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияПолучателейДоходов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеНаИностранскомЯзыке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидНачисленияУдержания</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyUserAccountId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PersonId</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>AzRyJiraUserIDs</name>
    <attributes>
      <name>id</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>70</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/src/Documents/ПлатежнаяВедомость/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Процедура - обработчик события ОбработкаЗаполнения объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры // ОбработкаЗаполнения()

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Сотрудники.Итог("СуммаПлатежа");
	//Паганини ПФ_
	СуммаНДФЛ	= Сотрудники.Итог("НДФЛПлатежа");
	СуммаПФ		= Сотрудники.Итог("СуммаПФПлатежа");
	//_Паганини ПФ	
	//Паганини#Удержания_
	Если НЕ ВидОперации = Перечисления.ВидыОперацийПлатежнаяВедомость.УдержаниеДляКонтрагента Тогда
		Для Каждого СтрокаС ИЗ Сотрудники Цикл
			СтрокаС.ВидУдержания 		= Неопределено;
		КонецЦикла;
	КонецЕсли;
	//_Паганини#Удержания
	
	//Малышев 2024-10-20 ONESOFT-3523
	СуммаРасчетов = Сотрудники.Итог("СуммаРасчетов");
	
	
КонецПроцедуры // ПередЗаписью()

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Процедура заполняет табличную часть Сотрудники остатками по начислениям.
//
Процедура ЗаполнитьПоОстаткамНаСервере() Экспорт
	
	Если ВидОперации = Перечисления.ВидыОперацийПлатежнаяВедомость.Зарплата Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	РасчетыСПерсоналомОстатки.Сотрудник,
		               |	СУММА(ВЫБОР
		               |			КОГДА &ВалютаРасчетов = &ВалютаДокумента
		               |				ТОГДА РасчетыСПерсоналомОстатки.СуммаВалОстаток
		               |			ИНАЧЕ ВЫРАЗИТЬ(РасчетыСПерсоналомОстатки.СуммаВалОстаток * &Курс / &Кратность КАК ЧИСЛО(15, 2))
		               |		КОНЕЦ) КАК СуммаПлатежа,
		               |	СУММА(РасчетыСПерсоналомОстатки.СуммаВалОстаток) КАК СуммаРасчетов
		               |ИЗ
		               |	РегистрНакопления.РасчетыСПерсоналом.Остатки(,
		               |			Организация = &Организация
		               |				И ПериодРегистрации = &ПериодРегистрации
		               |				И Валюта = &ВалютаРасчетов
		               |				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК РасчетыСПерсоналомОстатки
		               |ГДЕ
		               |	РасчетыСПерсоналомОстатки.СуммаВалОстаток > 0
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РасчетыСПерсоналомОстатки.Сотрудник
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	РасчетыСПерсоналомОстатки.Сотрудник.Наименование";
		
		Запрос.УстановитьПараметр("ПериодРегистрации", 	ПериодРегистрации);
		Запрос.УстановитьПараметр("Организация", 		УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация));
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
		Запрос.УстановитьПараметр("ВалютаРасчетов",		ВалютаРасчетов);
		Запрос.УстановитьПараметр("ВалютаДокумента",	ВалютаДокумента);
		Запрос.УстановитьПараметр("Курс",				Курс);
		Запрос.УстановитьПараметр("Кратность",			Кратность);
		
		Сотрудники.Загрузить(Запрос.Выполнить().Выгрузить());

	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПлатежнаяВедомость.Аванс Тогда	
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ka='ავანსის გადახდისას ნაშთების მიხედვით შევსება გათვალისწინებული არ არის!';ru='При выплате аванса заполнение по остаткам не предусмотрено!';en='Upon payment of the advance is not the filling of balances provided!'");
 		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполняет табличную часть Сотрудники по подразделению.
//
Процедура ЗаполнитьПоПодразделениюНаСервере() Экспорт
	
	// Сотрудники:
	// 1. Уволенные, переведенные из 
	//  - на начало периода есть запись о принадлежности к указанному подразделению;
	// 2. Работающие.
	//  - на начало периода есть запись о принадлежности к указанному подразделению;
	// 3. Принятые на работу, переведенные в
	//  - в течении периода будет запись с указанным подразделением;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(СотрудникиСрезПоследних.Период) КАК Период,
	|	СотрудникиСрезПоследних.Сотрудник КАК Сотрудник,
	|	СотрудникиСрезПоследних.ВидУдержанияНДФЛ,
	|	СотрудникиСрезПоследних.ВидУдержанияПФ,
	|	СотрудникиСрезПоследних.СтруктурнаяЕдиница
	|ПОМЕСТИТЬ СотрудникиЧислящиесяНаНачалоПериода
	|ИЗ
	|	РегистрСведений.Сотрудники.СрезПоследних(&ПериодРегистрации, Организация = &Организация) КАК СотрудникиСрезПоследних
	|ГДЕ
	|	СотрудникиСрезПоследних.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|
	|СГРУППИРОВАТЬ ПО
	|	СотрудникиСрезПоследних.Сотрудник,
	|	СотрудникиСрезПоследних.СтруктурнаяЕдиница,
	|	СотрудникиСрезПоследних.ВидУдержанияПФ,
	|	СотрудникиСрезПоследних.ВидУдержанияНДФЛ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сотрудники.Период КАК Период,
	|	Сотрудники.Сотрудник КАК Сотрудник,
	|	Сотрудники.ВидУдержанияНДФЛ,
	|	Сотрудники.ВидУдержанияПФ, 
	|	Сотрудники.СтруктурнаяЕдиница
	|ПОМЕСТИТЬ СотрудникиПереведенныеПринятыеВПериоде
	|ИЗ
	|	РегистрСведений.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Организация = &Организация
	|	И Сотрудники.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И Сотрудники.Период МЕЖДУ &ПериодРегистрации И КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СотрудникиЧислящиесяНаНачалоПериода.Сотрудник,
	|	СотрудникиЧислящиесяНаНачалоПериода.СтруктурнаяЕдиница,
	|	СотрудникиЧислящиесяНаНачалоПериода.ВидУдержанияНДФЛ,
	|	СотрудникиЧислящиесяНаНачалоПериода.ВидУдержанияПФ
	|ИЗ
	|	СотрудникиЧислящиесяНаНачалоПериода КАК СотрудникиЧислящиесяНаНачалоПериода
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СотрудникиПереведенныеПринятыеВПериоде.Сотрудник,
	|	СотрудникиПереведенныеПринятыеВПериоде.СтруктурнаяЕдиница,
	|	СотрудникиПереведенныеПринятыеВПериоде.ВидУдержанияНДФЛ,
	|	СотрудникиПереведенныеПринятыеВПериоде.ВидУдержанияПФ
	|ИЗ
	|	СотрудникиПереведенныеПринятыеВПериоде КАК СотрудникиПереведенныеПринятыеВПериоде";

	Запрос.УстановитьПараметр("ПериодРегистрации",	ПериодРегистрации);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница",	СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Организация",		УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация));
	
	Сотрудники.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры


//---РОССОФТ ----

// Процедура заполняет табличную часть Сотрудники остатками по начислениям.
//
Процедура ЗаполнитьПоОстаткамНаСервере_Новый() Экспорт
	
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	ДопСвойства = Новый Структура;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Константы.ФункциональнаяОпцияУчетПоПроектам КАК УчетПоПроектам
	|ИЗ
	|	Константы КАК Константы");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// Формирование ключей, содержащих данные учетной политики.
	Для каждого Колонка Из РезультатЗапроса.Колонки Цикл
		ДопСвойства.Вставить(Колонка.Имя);
	КонецЦикла;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	// Заполнение значений для ключей, содержащих данные учетной политики.
	ЗаполнитьЗначенияСвойств(ДопСвойства, Выборка);
	
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	
	Если ВидОперации = Перечисления.ВидыОперацийПлатежнаяВедомость.Зарплата Тогда
	
		Запрос = Новый Запрос;
		//Запрос.МенеджерВременныхТаблиц = новый МенеджерВременныхТаблиц;
		//Запрос.Текст = "ВЫБРАТЬ
		//               |	РасчетыПоУдержаниямОбороты.Организация КАК Организация,
		//               |	РасчетыПоУдержаниямОбороты.Сотрудник КАК Сотрудник,
		//               |	СУММА(РасчетыПоУдержаниямОбороты.СуммаПФОстаток) КАК СуммаПФОборот,
		//               |	СУММА(РасчетыПоУдержаниямОбороты.СуммаНДФЛОстаток) КАК СуммаНДФЛОборот
		//               |ПОМЕСТИТЬ РасчетыПоУдержаниямОстатки
		//               |ИЗ
		//               |	РегистрНакопления.РасчетыПоУдержаниям.Остатки(
		//               |			,
		//               |			Организация = &Организация
		//               |				И ПериодРегистрации = &ПериодРегистрации) КАК РасчетыПоУдержаниямОбороты
		//               |
		//               |СГРУППИРОВАТЬ ПО
		//               |	РасчетыПоУдержаниямОбороты.Организация,
		//               |	РасчетыПоУдержаниямОбороты.Сотрудник
		//               |;
		//               |
		//               |////////////////////////////////////////////////////////////////////////////////
		//               |ВЫБРАТЬ
		//               |	НалоговыеЛготыОстатки.Сотрудник,
		//               |	НалоговыеЛготыОстатки.СуммаОстаток,
		//               |	НалоговыеЛготыОстатки.Организация,
		//               |	НалоговыеЛготыОстатки.Подразделение
		//               |ПОМЕСТИТЬ ВтНалоговыеЛготы
		//               |ИЗ
		//               |	РегистрНакопления.НалоговыеЛготы.Остатки(
		//               |			&ДатаЛгот,
		//               |			Организация = &Организация
		//               |				И Подразделение = &СтруктурнаяЕдиница
		//               |				И ТипЛгот = &ТипЛгот) КАК НалоговыеЛготыОстатки
		//               |;
		//               |
		//               |////////////////////////////////////////////////////////////////////////////////
		//               |ВЫБРАТЬ
		//               |	ВЫРАЗИТЬ(РасчетыСПенсионнымФондомОстатки.Плательщик КАК Справочник.Сотрудники) КАК Сотрудник,
		//               |	РасчетыСПенсионнымФондомОстатки.ВидНачисленияУдержания КАК ВидУдержанияПФ,
		//               |	СУММА(РасчетыСПенсионнымФондомОстатки.СуммаВалОборот) КАК СуммаПФВалОстаток
		//               |ПОМЕСТИТЬ РасчетыПФ
		//               |ИЗ
		//               |	РегистрНакопления.РасчетыСПенсионнымФондом.Обороты(
		//               |			&ДатаНач,
		//               |			&ДатаКон,
		//               |			Регистратор,
		//               |			Организация = &Организация
		//               |				И ПериодРегистрации = &ПериодРегистрации
		//               |				И Плательщик ССЫЛКА Справочник.Сотрудники
		//               |				И Операция = ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный)) КАК РасчетыСПенсионнымФондомОстатки
		//               |ГДЕ
		//               |	РасчетыСПенсионнымФондомОстатки.СуммаВалОборот > 0
		//               |	И РасчетыСПенсионнымФондомОстатки.Регистратор ССЫЛКА Документ.НачислениеЗарплаты
		//               |	И РасчетыСПенсионнымФондомОстатки.Регистратор.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		//               |
		//               |СГРУППИРОВАТЬ ПО
		//               |	ВЫРАЗИТЬ(РасчетыСПенсионнымФондомОстатки.Плательщик КАК Справочник.Сотрудники),
		//               |	РасчетыСПенсионнымФондомОстатки.ВидНачисленияУдержания
		//               |;
		//               |
		//               |////////////////////////////////////////////////////////////////////////////////
		//               |ВЫБРАТЬ
		//               |	РасчетыНДФЛОбороты.ВидНачисленияУдержания КАК ВидУдержанияНДФЛ,
		//               |	РасчетыНДФЛОбороты.Сотрудник КАК Сотрудник,
		//               |	СУММА(РасчетыНДФЛОбороты.СуммаВалОборот) КАК СуммаВалОстаток
		//               |ПОМЕСТИТЬ РасчетыНДФЛ
		//               |ИЗ
		//               |	РегистрНакопления.РасчетыНДФЛ.Обороты(&ДатаНач, &ДатаКон, Регистратор, Организация = &Организация) КАК РасчетыНДФЛОбороты
		//               |ГДЕ
		//               |	РасчетыНДФЛОбороты.Регистратор ССЫЛКА Документ.НачислениеЗарплаты
		//               |	И РасчетыНДФЛОбороты.Регистратор.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		//               |
		//               |СГРУППИРОВАТЬ ПО
		//               |	РасчетыНДФЛОбороты.ВидНачисленияУдержания,
		//               |	РасчетыНДФЛОбороты.Сотрудник
		//               |;
		//               |
		//               |////////////////////////////////////////////////////////////////////////////////
		//               |ВЫБРАТЬ
		//               |	РасчетыСПерсоналомОстатки.Сотрудник,
		//               |	ВЫБОР
		//               |		КОГДА &ВалютаРасчетов = &ВалютаДокумента
		//               |			ТОГДА РасчетыСПерсоналомОстатки.СуммаВалОстаток
		//               |		ИНАЧЕ ВЫРАЗИТЬ(РасчетыСПерсоналомОстатки.СуммаВалОстаток * &Курс * КурсыВалютыДокумента.Кратность / КурсыВалютыДокумента.Курс * &Кратность КАК ЧИСЛО(15, 2))
		//               |	КОНЕЦ КАК СуммаПлатежа,
		//               |	РасчетыСПерсоналомОстатки.СуммаВалОстаток КАК СуммаРасчетов,
		//               |	РасчетыНДФЛ.ВидУдержанияНДФЛ КАК ВидУдержанияНДФЛ,
		//               |	ВЫБОР
		//               |		КОГДА &ВалютаРасчетов = &ВалютаДокумента
		//               |				И НЕ СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении.Значение
		//               |			ТОГДА РасчетыНДФЛ.СуммаВалОстаток - ЕСТЬNULL(РасчетыПоУдержаниямОстатки.СуммаНДФЛОборот, 0)
		//               |		КОГДА &ВалютаРасчетов = &ВалютаДокумента
		//               |				И СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении.Значение
		//               |			ТОГДА РасчетыНДФЛ.СуммаВалОстаток
		//               |		КОГДА &ВалютаРасчетов <> &ВалютаДокумента
		//               |				И НЕ СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении.Значение
		//               |			ТОГДА РасчетыНДФЛ.СуммаВалОстаток - ЕСТЬNULL(РасчетыПоУдержаниямОстатки.СуммаНДФЛОборот, 0)
		//               |		КОГДА &ВалютаРасчетов <> &ВалютаДокумента
		//               |				И СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении.Значение
		//               |			ТОГДА РасчетыНДФЛ.СуммаВалОстаток
		//               |		ИНАЧЕ РасчетыНДФЛ.СуммаВалОстаток - ЕСТЬNULL(РасчетыПоУдержаниямОстатки.СуммаНДФЛОборот, 0)
		//               |	КОНЕЦ КАК НДФЛПлатежа,
		//               |	РасчетыПФ.ВидУдержанияПФ КАК ВидУдержанияПФ,
		//               |	ВЫБОР
		//               |		КОГДА &ВалютаРасчетов = &ВалютаДокумента
		//               |				И НЕ СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении.Значение
		//               |			ТОГДА РасчетыПФ.СуммаПФВалОстаток - ЕСТЬNULL(РасчетыПоУдержаниямОстатки.СуммаПФОборот, 0)
		//               |		КОГДА &ВалютаРасчетов = &ВалютаДокумента
		//               |				И СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении.Значение
		//               |			ТОГДА РасчетыПФ.СуммаПФВалОстаток
		//               |		ИНАЧЕ ВЫРАЗИТЬ((РасчетыПФ.СуммаПФВалОстаток - ЕСТЬNULL(РасчетыПоУдержаниямОстатки.СуммаПФОборот, 0)) * &Курс * КурсыВалютыДокумента.Кратность / КурсыВалютыДокумента.Курс * &Кратность КАК ЧИСЛО(15, 2))
		//               |	КОНЕЦ КАК СуммаПФПлатежа,
		//               |	ВЫБОР
		//               |		КОГДА ВтНалоговыеЛготы.СуммаОстаток ЕСТЬ NULL
		//               |				ИЛИ ВтНалоговыеЛготы.СуммаОстаток < ВЫБОР
		//               |					КОГДА &ВалютаРасчетов = &ВалютаДокумента
		//               |						ТОГДА РасчетыСПерсоналомОстатки.СуммаВалОстаток
		//               |					ИНАЧЕ ВЫРАЗИТЬ(РасчетыСПерсоналомОстатки.СуммаВалОстаток * &Курс * КурсыВалютыДокумента.Кратность / КурсыВалютыДокумента.Курс * &Кратность КАК ЧИСЛО(15, 2))
		//               |				КОНЕЦ + ВЫБОР
		//               |					КОГДА &ВалютаРасчетов = &ВалютаДокумента
		//               |						ТОГДА РасчетыНДФЛ.СуммаВалОстаток - ЕСТЬNULL(РасчетыПоУдержаниямОстатки.СуммаНДФЛОборот, 0)
		//               |					ИНАЧЕ РасчетыНДФЛ.СуммаВалОстаток - ЕСТЬNULL(РасчетыПоУдержаниямОстатки.СуммаНДФЛОборот, 0)
		//               |				КОНЕЦ
		//               |			ТОГДА ВтНалоговыеЛготы.СуммаОстаток
		//               |		ИНАЧЕ ВЫБОР
		//               |				КОГДА &ВалютаРасчетов = &ВалютаДокумента
		//               |					ТОГДА РасчетыСПерсоналомОстатки.СуммаВалОстаток
		//               |				ИНАЧЕ ВЫРАЗИТЬ(РасчетыСПерсоналомОстатки.СуммаВалОстаток * &Курс * КурсыВалютыДокумента.Кратность / КурсыВалютыДокумента.Курс * &Кратность КАК ЧИСЛО(15, 2))
		//               |			КОНЕЦ + ВЫБОР
		//               |				КОГДА &ВалютаРасчетов = &ВалютаДокумента
		//               |					ТОГДА ЕСТЬNULL(РасчетыНДФЛ.СуммаВалОстаток, 0) - ЕСТЬNULL(РасчетыПоУдержаниямОстатки.СуммаНДФЛОборот, 0)
		//               |				ИНАЧЕ ЕСТЬNULL(РасчетыНДФЛ.СуммаВалОстаток, 0) - ЕСТЬNULL(РасчетыПоУдержаниямОстатки.СуммаНДФЛОборот, 0)
		//               |			КОНЕЦ
		//               |	КОНЕЦ КАК СуммаЛгот
		//               |ИЗ
		//               |	РегистрНакопления.РасчетыСПерсоналом.Остатки(
		//               |			,
		//               |			Организация = &Организация
		//               |				И ПериодРегистрации = &ПериодРегистрации
		//               |				И Валюта = &ВалютаРасчетов
		//               |				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК РасчетыСПерсоналомОстатки
		//               |		ЛЕВОЕ СОЕДИНЕНИЕ РасчетыПФ КАК РасчетыПФ
		//               |		ПО РасчетыСПерсоналомОстатки.Сотрудник = РасчетыПФ.Сотрудник
		//               |		ЛЕВОЕ СОЕДИНЕНИЕ РасчетыНДФЛ КАК РасчетыНДФЛ
		//               |		ПО РасчетыСПерсоналомОстатки.Сотрудник = РасчетыНДФЛ.Сотрудник
		//               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &ВалютаДокумента) КАК КурсыВалютыДокумента
		//               |		ПО (ИСТИНА)
		//               |		ЛЕВОЕ СОЕДИНЕНИЕ ВтНалоговыеЛготы КАК ВтНалоговыеЛготы
		//               |		ПО РасчетыСПерсоналомОстатки.Сотрудник = ВтНалоговыеЛготы.Сотрудник
		//               |			И РасчетыСПерсоналомОстатки.Организация = ВтНалоговыеЛготы.Организация
		//               |			И РасчетыСПерсоналомОстатки.СтруктурнаяЕдиница = ВтНалоговыеЛготы.Подразделение
		//               |		ЛЕВОЕ СОЕДИНЕНИЕ РасчетыПоУдержаниямОстатки КАК РасчетыПоУдержаниямОстатки
		//               |		ПО РасчетыСПерсоналомОстатки.Организация = РасчетыПоУдержаниямОстатки.Организация
		//               |			И РасчетыСПерсоналомОстатки.Сотрудник = РасчетыПоУдержаниямОстатки.Сотрудник,
		//               |	Константа.СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении КАК СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении
		//               |ГДЕ
		//               |	РасчетыСПерсоналомОстатки.СуммаВалОстаток > 0
		//               |
		//               |УПОРЯДОЧИТЬ ПО
		//               |	РасчетыСПерсоналомОстатки.Сотрудник.Наименование";
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетыПоУдержаниямОбороты.Организация КАК Организация,
		|	РасчетыПоУдержаниямОбороты.Сотрудник КАК Сотрудник,
		|	СУММА(РасчетыПоУдержаниямОбороты.СуммаПФОстаток) КАК СуммаПФОборот,
		|	СУММА(РасчетыПоУдержаниямОбороты.СуммаНДФЛОстаток) КАК СуммаНДФЛОборот
		|ПОМЕСТИТЬ РасчетыПоУдержаниямОстатки
		|ИЗ
		|	РегистрНакопления.РасчетыПоУдержаниям.Остатки(
		|			,
		|			Организация = &Организация
		|				И ПериодРегистрации = &ПериодРегистрации) КАК РасчетыПоУдержаниямОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыПоУдержаниямОбороты.Организация,
		|	РасчетыПоУдержаниямОбороты.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НалоговыеЛготыОстатки.Сотрудник,
		|	НалоговыеЛготыОстатки.СуммаОстаток,
		|	НалоговыеЛготыОстатки.Организация,
		|	НалоговыеЛготыОстатки.Подразделение
		|ПОМЕСТИТЬ ВтНалоговыеЛготы
		|ИЗ
		|	РегистрНакопления.НалоговыеЛготы.Остатки(
		|			&ДатаЛгот,
		|			Организация = &Организация
		//|				И Подразделение = &СтруктурнаяЕдиница
		|				И (&СтруктурнаяЕдиница = Значение(Справочник.СтруктурныеЕдиницы.ПустаяСсылка) или Подразделение = &СтруктурнаяЕдиница) //Малышев 2025-02-12 ONESOFT-3849
		|				И ТипЛгот = &ТипЛгот) КАК НалоговыеЛготыОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(РасчетыСПенсионнымФондомОстатки.Плательщик КАК Справочник.Сотрудники) КАК Сотрудник,
		|	РасчетыСПенсионнымФондомОстатки.ВидНачисленияУдержания КАК ВидУдержанияПФ,
		|	СУММА(РасчетыСПенсионнымФондомОстатки.СуммаВалОборот) КАК СуммаПФВалОстаток,
		//|	ЕСТЬNULL(ЕСТЬNULL(РасчетыСПенсионнымФондомОстатки.Регистратор.СтруктурнаяЕдиница, РасходИзКассыВыплатаЗаработнойПлаты.Ведомость.СтруктурнаяЕдиница), РасходСоСчетаВыплатаЗаработнойПлаты.Ведомость.СтруктурнаяЕдиница) КАК СтруктурнаяЕдиница
		|	ВЫБОР
		|		КОГДА РасчетыСПенсионнымФондомОстатки.Регистратор ССЫЛКА Документ.РасходИзКассы
		|			ТОГДА РасходИзКассыВыплатаЗаработнойПлаты.Ведомость.СтруктурнаяЕдиница
		|		КОГДА РасчетыСПенсионнымФондомОстатки.Регистратор ССЫЛКА Документ.РасходСоСчета
		|			ТОГДА РасходСоСчетаВыплатаЗаработнойПлаты.Ведомость.СтруктурнаяЕдиница
		|		КОГДА РасчетыСПенсионнымФондомОстатки.Регистратор ССЫЛКА Документ.ЗаказПокупателя
		|			ТОГДА РасчетыСПенсионнымФондомОстатки.Регистратор.СтруктурнаяЕдиницаПродажи
		|		ИНАЧЕ ЕСТЬNULL(РасчетыСПенсионнымФондомОстатки.Регистратор.СтруктурнаяЕдиница, НЕОПРЕДЕЛЕНО)
		|	КОНЕЦ КАК СтруктурнаяЕдиница //++lyskov 16.02.2023
		|ПОМЕСТИТЬ РасчетыПФ
		|ИЗ
		|	РегистрНакопления.РасчетыСПенсионнымФондом.Обороты(
		|			,
		|			,
		|			Регистратор,
		|			Организация = &Организация
		|				И ПериодРегистрации = &ПериодРегистрации
		|				И Плательщик ССЫЛКА Справочник.Сотрудники
		|				И Операция = ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный)) КАК РасчетыСПенсионнымФондомОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходИзКассы.ВыплатаЗаработнойПлаты КАК РасходИзКассыВыплатаЗаработнойПлаты
		|		ПО (ВЫБОР
		|				КОГДА РасчетыСПенсионнымФондомОстатки.Регистратор ССЫЛКА Документ.РасходИзКассы
		|					ТОГДА РасчетыСПенсионнымФондомОстатки.Регистратор = РасходИзКассыВыплатаЗаработнойПлаты.Ссылка
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходСоСчета.ВыплатаЗаработнойПлаты КАК РасходСоСчетаВыплатаЗаработнойПлаты
		|		ПО (ВЫБОР
		|				КОГДА РасчетыСПенсионнымФондомОстатки.Регистратор ССЫЛКА Документ.РасходСоСчета
		|					ТОГДА РасчетыСПенсионнымФондомОстатки.Регистратор = РасходСоСчетаВыплатаЗаработнойПлаты.Ссылка
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|ГДЕ
		//|	ЕСТЬNULL(ЕСТЬNULL(РасчетыСПенсионнымФондомОстатки.Регистратор.СтруктурнаяЕдиница, РасходИзКассыВыплатаЗаработнойПлаты.Ведомость.СтруктурнаяЕдиница), РасходСоСчетаВыплатаЗаработнойПлаты.Ведомость.СтруктурнаяЕдиница) = &СтруктурнаяЕдиница
		|	&СтруктурнаяЕдиница = Значение(Справочник.СтруктурныеЕдиницы.ПустаяСсылка) ИЛИ //Малышев 2025-02-12 ONESOFT-3849
		|	ВЫБОР
		|		КОГДА РасчетыСПенсионнымФондомОстатки.Регистратор ССЫЛКА Документ.РасходИзКассы
		|			ТОГДА РасходИзКассыВыплатаЗаработнойПлаты.Ведомость.СтруктурнаяЕдиница
		|		КОГДА РасчетыСПенсионнымФондомОстатки.Регистратор ССЫЛКА Документ.РасходСоСчета
		|			ТОГДА РасходСоСчетаВыплатаЗаработнойПлаты.Ведомость.СтруктурнаяЕдиница
		|		КОГДА РасчетыСПенсионнымФондомОстатки.Регистратор ССЫЛКА Документ.ЗаказПокупателя
		|			ТОГДА РасчетыСПенсионнымФондомОстатки.Регистратор.СтруктурнаяЕдиницаПродажи
		|		ИНАЧЕ ЕСТЬNULL(РасчетыСПенсионнымФондомОстатки.Регистратор.СтруктурнаяЕдиница, НЕОПРЕДЕЛЕНО)
		|	КОНЕЦ = &СтруктурнаяЕдиница //++lyskov 16.02.2023
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫРАЗИТЬ(РасчетыСПенсионнымФондомОстатки.Плательщик КАК Справочник.Сотрудники),
		|	РасчетыСПенсионнымФондомОстатки.ВидНачисленияУдержания,
		//|	ЕСТЬNULL(ЕСТЬNULL(РасчетыСПенсионнымФондомОстатки.Регистратор.СтруктурнаяЕдиница, РасходИзКассыВыплатаЗаработнойПлаты.Ведомость.СтруктурнаяЕдиница), РасходСоСчетаВыплатаЗаработнойПлаты.Ведомость.СтруктурнаяЕдиница)
		|	ВЫБОР
		|		КОГДА РасчетыСПенсионнымФондомОстатки.Регистратор ССЫЛКА Документ.РасходИзКассы
		|			ТОГДА РасходИзКассыВыплатаЗаработнойПлаты.Ведомость.СтруктурнаяЕдиница
		|		КОГДА РасчетыСПенсионнымФондомОстатки.Регистратор ССЫЛКА Документ.РасходСоСчета
		|			ТОГДА РасходСоСчетаВыплатаЗаработнойПлаты.Ведомость.СтруктурнаяЕдиница
		|		КОГДА РасчетыСПенсионнымФондомОстатки.Регистратор ССЫЛКА Документ.ЗаказПокупателя
		|			ТОГДА РасчетыСПенсионнымФондомОстатки.Регистратор.СтруктурнаяЕдиницаПродажи
		|		ИНАЧЕ ЕСТЬNULL(РасчетыСПенсионнымФондомОстатки.Регистратор.СтруктурнаяЕдиница, НЕОПРЕДЕЛЕНО)
		|	КОНЕЦ //++lyskov 16.02.2023
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыНДФЛОбороты.ВидНачисленияУдержания КАК ВидУдержанияНДФЛ,
		|	РасчетыНДФЛОбороты.Сотрудник КАК Сотрудник,
		//|	СУММА(РасчетыНДФЛОбороты.СуммаОборот) КАК СуммаВалОстаток, //СуммаВалОборот) КАК СуммаВалОстаток,
		|	СУММА(РасчетыНДФЛОбороты.СуммаВалОборот) КАК СуммаВалОстаток, //++lazare 12.21.2022
		//|	ЕСТЬNULL(ЕСТЬNULL(РасчетыНДФЛОбороты.Регистратор.СтруктурнаяЕдиница, РасходИзКассыВыплатаЗаработнойПлаты.Ведомость.СтруктурнаяЕдиница), РасходСоСчетаВыплатаЗаработнойПлаты.Ведомость.СтруктурнаяЕдиница) КАК СтруктурнаяЕдиница
		|	ВЫБОР
		|		КОГДА РасчетыНДФЛОбороты.Регистратор ССЫЛКА Документ.РасходИзКассы
		|			ТОГДА РасходИзКассыВыплатаЗаработнойПлаты.Ведомость.СтруктурнаяЕдиница
		|		КОГДА РасчетыНДФЛОбороты.Регистратор ССЫЛКА Документ.РасходСоСчета
		|			ТОГДА РасходСоСчетаВыплатаЗаработнойПлаты.Ведомость.СтруктурнаяЕдиница
		|		КОГДА РасчетыНДФЛОбороты.Регистратор ССЫЛКА Документ.ЗаказПокупателя
		|			ТОГДА РасчетыНДФЛОбороты.Регистратор.СтруктурнаяЕдиницаПродажи
		|		ИНАЧЕ ЕСТЬNULL(РасчетыНДФЛОбороты.Регистратор.СтруктурнаяЕдиница, НЕОПРЕДЕЛЕНО)
		|	КОНЕЦ КАК СтруктурнаяЕдиница //++lyskov 16.02.2023
		|
		|ПОМЕСТИТЬ РасчетыНДФЛ
		|ИЗ
		|	РегистрНакопления.РасчетыНДФЛ.Обороты(
		|			,
		|			,
		|			Регистратор,
		|			Организация = &Организация
		|				И ПериодРегистрации = &ПериодРегистрации
		|				И Операция = ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный)) КАК РасчетыНДФЛОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходИзКассы.ВыплатаЗаработнойПлаты КАК РасходИзКассыВыплатаЗаработнойПлаты
		|		ПО (ВЫБОР
		|				КОГДА РасчетыНДФЛОбороты.Регистратор ССЫЛКА Документ.РасходИзКассы
		|					ТОГДА РасчетыНДФЛОбороты.Регистратор = РасходИзКассыВыплатаЗаработнойПлаты.Ссылка
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходСоСчета.ВыплатаЗаработнойПлаты КАК РасходСоСчетаВыплатаЗаработнойПлаты
		|		ПО (ВЫБОР
		|				КОГДА РасчетыНДФЛОбороты.Регистратор ССЫЛКА Документ.РасходСоСчета
		|					ТОГДА РасчетыНДФЛОбороты.Регистратор = РасходСоСчетаВыплатаЗаработнойПлаты.Ссылка
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|ГДЕ
		//|	ЕСТЬNULL(ЕСТЬNULL(РасчетыНДФЛОбороты.Регистратор.СтруктурнаяЕдиница, РасходИзКассыВыплатаЗаработнойПлаты.Ведомость.СтруктурнаяЕдиница), РасходСоСчетаВыплатаЗаработнойПлаты.Ведомость.СтруктурнаяЕдиница) = &СтруктурнаяЕдиница
		|	&СтруктурнаяЕдиница = Значение(Справочник.СтруктурныеЕдиницы.ПустаяСсылка) ИЛИ //Малышев 2025-02-12 ONESOFT-3849
		|	ВЫБОР
		|		КОГДА РасчетыНДФЛОбороты.Регистратор ССЫЛКА Документ.РасходИзКассы
		|			ТОГДА РасходИзКассыВыплатаЗаработнойПлаты.Ведомость.СтруктурнаяЕдиница
		|		КОГДА РасчетыНДФЛОбороты.Регистратор ССЫЛКА Документ.РасходСоСчета
		|			ТОГДА РасходСоСчетаВыплатаЗаработнойПлаты.Ведомость.СтруктурнаяЕдиница
		|		КОГДА РасчетыНДФЛОбороты.Регистратор ССЫЛКА Документ.ЗаказПокупателя
		|			ТОГДА РасчетыНДФЛОбороты.Регистратор.СтруктурнаяЕдиницаПродажи
		|		ИНАЧЕ ЕСТЬNULL(РасчетыНДФЛОбороты.Регистратор.СтруктурнаяЕдиница, НЕОПРЕДЕЛЕНО)
		|	КОНЕЦ = &СтруктурнаяЕдиница //++lyskov 16.02.2023
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыНДФЛОбороты.ВидНачисленияУдержания,
		|	РасчетыНДФЛОбороты.Сотрудник,
		//|	ЕСТЬNULL(ЕСТЬNULL(РасчетыНДФЛОбороты.Регистратор.СтруктурнаяЕдиница, РасходИзКассыВыплатаЗаработнойПлаты.Ведомость.СтруктурнаяЕдиница), РасходСоСчетаВыплатаЗаработнойПлаты.Ведомость.СтруктурнаяЕдиница)
		|	ВЫБОР
		|		КОГДА РасчетыНДФЛОбороты.Регистратор ССЫЛКА Документ.РасходИзКассы
		|			ТОГДА РасходИзКассыВыплатаЗаработнойПлаты.Ведомость.СтруктурнаяЕдиница
		|		КОГДА РасчетыНДФЛОбороты.Регистратор ССЫЛКА Документ.РасходСоСчета
		|			ТОГДА РасходСоСчетаВыплатаЗаработнойПлаты.Ведомость.СтруктурнаяЕдиница
		|		КОГДА РасчетыНДФЛОбороты.Регистратор ССЫЛКА Документ.ЗаказПокупателя
		|			ТОГДА РасчетыНДФЛОбороты.Регистратор.СтруктурнаяЕдиницаПродажи
		|		ИНАЧЕ ЕСТЬNULL(РасчетыНДФЛОбороты.Регистратор.СтруктурнаяЕдиница, НЕОПРЕДЕЛЕНО)
		|	КОНЕЦ //++lyskov 16.02.2023
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыСПерсоналомОстатки.Сотрудник КАК Сотрудник, 
		|	РасчетыСПерсоналомОстатки.СтруктурнаяЕдиница как СтруктурнаяЕдиница, //Малышев 2025-02-12 ONESOFT-3849
		|	ВЫБОР
		|		КОГДА &ВалютаРасчетов = &ВалютаДокумента
		|			ТОГДА РасчетыСПерсоналомОстатки.СуммаВалОстаток
		|		ИНАЧЕ ВЫРАЗИТЬ(РасчетыСПерсоналомОстатки.СуммаВалОстаток * &Курс * КурсыВалютыДокумента.Кратность / КурсыВалютыДокумента.Курс * &Кратность КАК ЧИСЛО(15, 2))
		|	КОНЕЦ КАК СуммаПлатежа,
		|	РасчетыСПерсоналомОстатки.СуммаВалОстаток КАК СуммаРасчетов,
		|	РасчетыНДФЛ.ВидУдержанияНДФЛ КАК ВидУдержанияНДФЛ,
		|	ВЫБОР
		|		КОГДА &ВалютаРасчетов = &ВалютаДокумента
		|				И НЕ СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении.Значение
		|			ТОГДА РасчетыНДФЛ.СуммаВалОстаток - ЕСТЬNULL(РасчетыПоУдержаниямОстатки.СуммаНДФЛОборот, 0)
		|		КОГДА &ВалютаРасчетов = &ВалютаДокумента
		|				И СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении.Значение
		|			ТОГДА РасчетыНДФЛ.СуммаВалОстаток
		|		КОГДА &ВалютаРасчетов <> &ВалютаДокумента
		|				И НЕ СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении.Значение
		//|			ТОГДА РасчетыНДФЛ.СуммаВалОстаток - ЕСТЬNULL(РасчетыПоУдержаниямОстатки.СуммаНДФЛОборот, 0)
		//++Lazare 12.21.2022
		|			ТОГДА ВЫРАЗИТЬ((РасчетыНДФЛ.СуммаВалОстаток - ЕСТЬNULL(РасчетыПоУдержаниямОстатки.СуммаНДФЛОборот, 0)) * &Курс * КурсыВалютыДокумента.Кратность / КурсыВалютыДокумента.Курс * &Кратность КАК ЧИСЛО(15, 2))
		//--Lazare 12.21.2022
		|		КОГДА &ВалютаРасчетов <> &ВалютаДокумента
		|				И СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении.Значение
		|			ТОГДА РасчетыНДФЛ.СуммаВалОстаток
		|		ИНАЧЕ РасчетыНДФЛ.СуммаВалОстаток - ЕСТЬNULL(РасчетыПоУдержаниямОстатки.СуммаНДФЛОборот, 0)
		|	КОНЕЦ КАК НДФЛПлатежа,
		|	РасчетыПФ.ВидУдержанияПФ КАК ВидУдержанияПФ,
		|	ВЫБОР
		|		КОГДА &ВалютаРасчетов = &ВалютаДокумента
		|				И НЕ СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении.Значение
		|			ТОГДА РасчетыПФ.СуммаПФВалОстаток - ЕСТЬNULL(РасчетыПоУдержаниямОстатки.СуммаПФОборот, 0)
		|		КОГДА &ВалютаРасчетов = &ВалютаДокумента
		|				И СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении.Значение
		|			ТОГДА РасчетыПФ.СуммаПФВалОстаток
		|		ИНАЧЕ ВЫРАЗИТЬ((РасчетыПФ.СуммаПФВалОстаток - ЕСТЬNULL(РасчетыПоУдержаниямОстатки.СуммаПФОборот, 0)) * &Курс * КурсыВалютыДокумента.Кратность / КурсыВалютыДокумента.Курс * &Кратность КАК ЧИСЛО(15, 2))
		|	КОНЕЦ КАК СуммаПФПлатежа,
		|	ВЫБОР
		|		КОГДА ВтНалоговыеЛготы.СуммаОстаток ЕСТЬ NULL
		|				ИЛИ ВтНалоговыеЛготы.СуммаОстаток < ВЫБОР
		|					КОГДА &ВалютаРасчетов = &ВалютаДокумента
		|						ТОГДА РасчетыСПерсоналомОстатки.СуммаВалОстаток
		|					ИНАЧЕ ВЫРАЗИТЬ(РасчетыСПерсоналомОстатки.СуммаВалОстаток * &Курс * КурсыВалютыДокумента.Кратность / КурсыВалютыДокумента.Курс * &Кратность КАК ЧИСЛО(15, 2))
		|				КОНЕЦ + ВЫБОР
		|					КОГДА &ВалютаРасчетов = &ВалютаДокумента
		|						ТОГДА РасчетыНДФЛ.СуммаВалОстаток - ЕСТЬNULL(РасчетыПоУдержаниямОстатки.СуммаНДФЛОборот, 0)
		|					ИНАЧЕ РасчетыНДФЛ.СуммаВалОстаток - ЕСТЬNULL(РасчетыПоУдержаниямОстатки.СуммаНДФЛОборот, 0)
		|				КОНЕЦ
		|			ТОГДА ВтНалоговыеЛготы.СуммаОстаток
		|		ИНАЧЕ ВЫБОР
		|				КОГДА &ВалютаРасчетов = &ВалютаДокумента
		|					ТОГДА РасчетыСПерсоналомОстатки.СуммаВалОстаток
		|				ИНАЧЕ ВЫРАЗИТЬ(РасчетыСПерсоналомОстатки.СуммаВалОстаток * &Курс * КурсыВалютыДокумента.Кратность / КурсыВалютыДокумента.Курс * &Кратность КАК ЧИСЛО(15, 2))
		|			КОНЕЦ + ВЫБОР
		|				КОГДА &ВалютаРасчетов = &ВалютаДокумента
		|					ТОГДА ЕСТЬNULL(РасчетыНДФЛ.СуммаВалОстаток, 0) - ЕСТЬNULL(РасчетыПоУдержаниямОстатки.СуммаНДФЛОборот, 0)
		|				ИНАЧЕ ЕСТЬNULL(РасчетыНДФЛ.СуммаВалОстаток, 0) - ЕСТЬNULL(РасчетыПоУдержаниямОстатки.СуммаНДФЛОборот, 0)
		|			КОНЕЦ
		|	КОНЕЦ КАК СуммаЛгот
		|ИЗ
		|	РегистрНакопления.РасчетыСПерсоналом.Остатки(
		|			,
		|			Организация = &Организация
		|				И ПериодРегистрации = &ПериодРегистрации
		|				И Валюта = &ВалютаРасчетов
		//|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|				И (&СтруктурнаяЕдиница = Значение(Справочник.СтруктурныеЕдиницы.ПустаяСсылка) ИЛИ СтруктурнаяЕдиница = &СтруктурнаяЕдиница)//Малышев 2025-02-12 ONESOFT-3849
		|			) КАК РасчетыСПерсоналомОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РасчетыПФ КАК РасчетыПФ
		|		ПО РасчетыСПерсоналомОстатки.Сотрудник = РасчетыПФ.Сотрудник
		|			И РасчетыСПерсоналомОстатки.СтруктурнаяЕдиница = РасчетыПФ.СтруктурнаяЕдиница
		|		ЛЕВОЕ СОЕДИНЕНИЕ РасчетыНДФЛ КАК РасчетыНДФЛ
		|		ПО РасчетыСПерсоналомОстатки.Сотрудник = РасчетыНДФЛ.Сотрудник
		|			И РасчетыСПерсоналомОстатки.СтруктурнаяЕдиница = РасчетыНДФЛ.СтруктурнаяЕдиница
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &ВалютаДокумента) КАК КурсыВалютыДокумента
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтНалоговыеЛготы КАК ВтНалоговыеЛготы
		|		ПО РасчетыСПерсоналомОстатки.Сотрудник = ВтНалоговыеЛготы.Сотрудник
		|			И РасчетыСПерсоналомОстатки.Организация = ВтНалоговыеЛготы.Организация
		|			И РасчетыСПерсоналомОстатки.СтруктурнаяЕдиница = ВтНалоговыеЛготы.Подразделение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РасчетыПоУдержаниямОстатки КАК РасчетыПоУдержаниямОстатки
		|		ПО РасчетыСПерсоналомОстатки.Организация = РасчетыПоУдержаниямОстатки.Организация
		|			И РасчетыСПерсоналомОстатки.Сотрудник = РасчетыПоУдержаниямОстатки.Сотрудник,
		|	Константа.СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении КАК СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении
		|ГДЕ
		|	РасчетыСПерсоналомОстатки.СуммаВалОстаток > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	РасчетыСПерсоналомОстатки.Сотрудник.Наименование";
		
		Запрос.УстановитьПараметр("ПериодРегистрации", 	ПериодРегистрации);
		Запрос.УстановитьПараметр("ДатаЛгот", 	        ПериодРегистрации + 1);
		Запрос.УстановитьПараметр("Организация", 		УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация));
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
		Запрос.УстановитьПараметр("ВалютаРасчетов",		ВалютаРасчетов);
		Запрос.УстановитьПараметр("ВалютаДокумента",	ВалютаДокумента);
		Запрос.УстановитьПараметр("Курс",				Курс);
		Запрос.УстановитьПараметр("Кратность",			Кратность);
		Запрос.УстановитьПараметр("КонецМесяца", 		КонецМесяца(ПериодРегистрации));
		Запрос.УстановитьПараметр("Дата", 				КонецМесяца(ПериодРегистрации));//Дата);
		Запрос.УстановитьПараметр("ТипЛгот", 			Перечисления.ТипЛгот.Прочее);
		//+++ Дмгг
		Запрос.УстановитьПараметр("ДатаНач", 			НачалоМесяца(ПериодРегистрации));
		Запрос.УстановитьПараметр("ДатаКон", 			КонецМесяца(ПериодРегистрации));
		//--- Дмгг
		
		//+++ Дмгг
		// Сори не біло времени,, нужно біло срочно исправить
		//Сотрудники.Загрузить(Запрос.Выполнить().Выгрузить()); 
		Сотрудники.Очистить();
		тзРезультат = Запрос.Выполнить().Выгрузить();
		Для Каждого Строк Из тзРезультат Цикл 
			НовСтрок = Сотрудники.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрок, Строк);
			РасчитатьСуммы_ПФ_НДФЛ(НовСтрок);
		КонецЦикла;
		//--- Дмгг
		
		//ПодольскийАИ #УчетПроектов 25.11.2020 {
		Если ДопСвойства.Свойство("УчетПоПроектам") И ДопСвойства.УчетПоПроектам Тогда
			РаспределитьОстаткиСотрудникиПоПроектам();
		КонецЕсли;
		//ПодольскийАИ #УчетПроектов 25.11.2020 }

	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПлатежнаяВедомость.Аванс Тогда	
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ka='ავანსის გადახდისას ნაშთების მიხედვით შევსება გათვალისწინებული არ არის!';ru='При выплате аванса заполнение по остаткам не предусмотрено!';en='Upon payment of the advance is not the filling of balances provided!'");
 		Сообщение.Сообщить();
	//Паганини#Удержания_
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПлатежнаяВедомость.УдержаниеДляКонтрагента Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НалоговыеЛготыОстатки.Сотрудник,
			|	НалоговыеЛготыОстатки.СуммаОстаток,
			|	НалоговыеЛготыОстатки.Организация,
			|	НалоговыеЛготыОстатки.Подразделение
			|ПОМЕСТИТЬ ВтНалоговыеЛготы
			|ИЗ
			|	РегистрНакопления.НалоговыеЛготы.Остатки(
			|			&ДатаЛгот,
			|			Организация = &Организация
			//|				И Подразделение = &СтруктурнаяЕдиница
			|				И (&СтруктурнаяЕдиница = Значение(Справочник.СтруктурныеЕдиницы.ПустаяСсылка) или Подразделение = &СтруктурнаяЕдиница) //Малышев 2025-02-13 ONESOFT-3849
			|				И ТипЛгот = &ТипЛгот) КАК НалоговыеЛготыОстатки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РасчетыПоУдержаниямОбороты.Организация,
			|	РасчетыПоУдержаниямОбороты.Сотрудник,
			|	СотрудникиСрезПоследних.СтруктурнаяЕдиница,  //Малышев 2025-02-13 ONESOFT-3849 
			|	РасчетыПоУдержаниямОбороты.ВидУдержания,
			|	РасчетыПоУдержаниямОбороты.ВидУдержанияНДФЛ,
			|	РасчетыПоУдержаниямОбороты.ВидУдержанияПФ,
			|	СУММА(ВЫБОР
			|			КОГДА &ВалютаУчета = &ВалютаДокумента
			|				ТОГДА РасчетыПоУдержаниямОбороты.СуммаОборот
			|			ИНАЧЕ ВЫРАЗИТЬ(РасчетыПоУдержаниямОбороты.СуммаОборот * КурсВалютыУчета.Курс * КурсВалютыДокумента.Кратность / КурсВалютыДокумента.Курс * КурсВалютыУчета.Кратность КАК ЧИСЛО(15, 2))
			|		КОНЕЦ) КАК СуммаРасчетов,
			|	СУММА(ВЫБОР
			|			КОГДА &ВалютаРасчетов = &ВалютаДокумента
			|				ТОГДА РасчетыПоУдержаниямОбороты.СуммаОборот
			|			ИНАЧЕ ВЫРАЗИТЬ(РасчетыПоУдержаниямОбороты.СуммаОборот * &Курс * КурсВалютыДокумента.Кратность / КурсВалютыДокумента.Курс * &Кратность КАК ЧИСЛО(15, 2))
			|		КОНЕЦ) КАК СуммаПлатежа,
			|	СУММА(ВЫБОР
			|			КОГДА &ВалютаРасчетов = &ВалютаДокумента
			|				ТОГДА РасчетыПоУдержаниямОбороты.СуммаНДФЛОборот
			|			ИНАЧЕ ВЫРАЗИТЬ(РасчетыПоУдержаниямОбороты.СуммаНДФЛОборот * &Курс * КурсВалютыДокумента.Кратность / КурсВалютыДокумента.Курс * &Кратность КАК ЧИСЛО(15, 2))
			|		КОНЕЦ) КАК НДФЛПлатежа,
			|	СУММА(ВЫБОР
			|			КОГДА &ВалютаРасчетов = &ВалютаДокумента
			|				ТОГДА РасчетыПоУдержаниямОбороты.СуммаПФОборот
			|			ИНАЧЕ ВЫРАЗИТЬ(РасчетыПоУдержаниямОбороты.СуммаПФОборот * &Курс * КурсВалютыДокумента.Кратность / КурсВалютыДокумента.Курс * &Кратность КАК ЧИСЛО(15, 2))
			|		КОНЕЦ) КАК СуммаПФПлатежа,
			|	ВЫБОР
			|		КОГДА СУММА(ВтНалоговыеЛготы.СуммаОстаток) ЕСТЬ NULL
			|				ИЛИ СУММА(ВтНалоговыеЛготы.СуммаОстаток) < СУММА(ВЫБОР
			|						КОГДА &ВалютаУчета = &ВалютаДокумента
			|							ТОГДА РасчетыПоУдержаниямОбороты.СуммаОборот
			|						ИНАЧЕ ВЫРАЗИТЬ(РасчетыПоУдержаниямОбороты.СуммаОборот * КурсВалютыУчета.Курс * КурсВалютыДокумента.Кратность / КурсВалютыДокумента.Курс * КурсВалютыУчета.Кратность КАК ЧИСЛО(15, 2))
			|					КОНЕЦ) + СУММА(ВЫБОР
			|						КОГДА &ВалютаРасчетов = &ВалютаДокумента
			|							ТОГДА РасчетыПоУдержаниямОбороты.СуммаНДФЛОборот
			|						ИНАЧЕ ВЫРАЗИТЬ(РасчетыПоУдержаниямОбороты.СуммаНДФЛОборот * &Курс * КурсВалютыДокумента.Кратность / КурсВалютыДокумента.Курс * &Кратность КАК ЧИСЛО(15, 2))
			|					КОНЕЦ)
			|			ТОГДА СУММА(ВтНалоговыеЛготы.СуммаОстаток)
			|		ИНАЧЕ СУММА(ВЫБОР
			|					КОГДА &ВалютаУчета = &ВалютаДокумента
			|						ТОГДА РасчетыПоУдержаниямОбороты.СуммаОборот
			|					ИНАЧЕ ВЫРАЗИТЬ(РасчетыПоУдержаниямОбороты.СуммаОборот * КурсВалютыУчета.Курс * КурсВалютыДокумента.Кратность / КурсВалютыДокумента.Курс * КурсВалютыУчета.Кратность КАК ЧИСЛО(15, 2))
			|				КОНЕЦ) + СУММА(ВЫБОР
			|					КОГДА &ВалютаРасчетов = &ВалютаДокумента
			|						ТОГДА РасчетыПоУдержаниямОбороты.СуммаНДФЛОборот
			|					ИНАЧЕ ВЫРАЗИТЬ(РасчетыПоУдержаниямОбороты.СуммаНДФЛОборот * &Курс * КурсВалютыДокумента.Кратность / КурсВалютыДокумента.Курс * &Кратность КАК ЧИСЛО(15, 2))
			|				КОНЕЦ)
			|	КОНЕЦ КАК СуммаЛгот
			|ИЗ
			|	РегистрНакопления.РасчетыПоУдержаниям.Обороты(, , Авто, ПериодРегистрации = &ПериодРегистрации) КАК РасчетыПоУдержаниямОбороты
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &ВалютаДокумента) КАК КурсВалютыДокумента
			|		ПО (ИСТИНА)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &ВалютаУчета) КАК КурсВалютыУчета
			|		ПО (ИСТИНА)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Сотрудники.СрезПоследних(&Дата, ) КАК СотрудникиСрезПоследних
			|		ПО РасчетыПоУдержаниямОбороты.Организация = СотрудникиСрезПоследних.Организация
			|			И РасчетыПоУдержаниямОбороты.Сотрудник = СотрудникиСрезПоследних.Сотрудник
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВтНалоговыеЛготы КАК ВтНалоговыеЛготы
			|		ПО (СотрудникиСрезПоследних.Сотрудник = ВтНалоговыеЛготы.Сотрудник)
			|			И (СотрудникиСрезПоследних.Организация = ВтНалоговыеЛготы.Организация)
			|			И (СотрудникиСрезПоследних.СтруктурнаяЕдиница = ВтНалоговыеЛготы.Подразделение)
			|
			|//Малышев 2024-05-28 ONESOFT-3185 - сняли ораничение на подразделение сотрудника
			|//ГДЕ
			|//	СотрудникиСрезПоследних.СтруктурнаяЕдиница = &СтруктурнаяЕдиница 
			|ГДЕ
			|	&СтруктурнаяЕдиница = Значение(Справочник.СтруктурныеЕдиницы.ПустаяССылка) или (СотрудникиСрезПоследних.СтруктурнаяЕдиница = &СтруктурнаяЕдиница) //Малышев 2025-02-13 ONESOFT-3849
			|
			|СГРУППИРОВАТЬ ПО
			|	РасчетыПоУдержаниямОбороты.Организация,
			|	РасчетыПоУдержаниямОбороты.Сотрудник, 
			|	СотрудникиСрезПоследних.СтруктурнаяЕдиница,  //Малышев 2025-02-13 ONESOFT-3849 
			|	РасчетыПоУдержаниямОбороты.ВидУдержания,
			|	РасчетыПоУдержаниямОбороты.ВидУдержанияПФ,
			|	РасчетыПоУдержаниямОбороты.ВидУдержанияНДФЛ";
		
		Запрос.УстановитьПараметр("ВалютаРасчетов",		ВалютаРасчетов);
		Запрос.УстановитьПараметр("ВалютаДокумента",	ВалютаДокумента);
		Запрос.УстановитьПараметр("ВалютаУчета",		УправлениеНебольшойФирмойПовтИсп.ПолучитьВалютуУчета());
		Запрос.УстановитьПараметр("Курс",				Курс);
		Запрос.УстановитьПараметр("Организация", 		УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация));
		Запрос.УстановитьПараметр("Кратность",			Кратность);
		Запрос.УстановитьПараметр("Дата", 				Дата);
		Запрос.УстановитьПараметр("ПериодРегистрации", 	ПериодРегистрации);
		Запрос.УстановитьПараметр("ДатаЛгот", 	        ПериодРегистрации + 1);
		Запрос.УстановитьПараметр("ТипЛгот", 			Перечисления.ТипЛгот.УдержаниеДляКонтрагента);
		
		//Малышев 2025-02-13 ONESOFT-3849
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница",	СтруктурнаяЕдиница);
		//Если ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
		//	Запрос.УстановитьПараметр("СтруктурнаяЕдиница",	СтруктурнаяЕдиница);
		//Иначе
		//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "СотрудникиСрезПоследних.СтруктурнаяЕдиница = &СтруктурнаяЕдиница", "Истина");
		//КонецЕсли; 
		
		Сотрудники.Загрузить(Запрос.Выполнить().Выгрузить());
	//_Паганини#Удержания
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

//Паганини#Удержания_
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ВидОперации = Перечисления.ВидыОперацийПлатежнаяВедомость.УдержаниеДляКонтрагента Тогда
		ПроверяемыеРеквизиты.Добавить("Сотрудники.ВидУдержания");
	Иначе
		ПроверяемыеРеквизиты.Добавить("СтруктурнаяЕдиница");
	КонецЕсли;
КонецПроцедуры

Процедура СообщитьОбОшибке(НомерСтроки, ИмяПоля, СинонимПоля, Отказ)
	ТекстСообщения = "სტრიქონში " + НомерСтроки + " არ არის შევსებული სვეტი " + СинонимПоля;
	УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(ЭтотОбъект,	ТекстСообщения, "Сотрудники", НомерСтроки, ИмяПоля, Отказ);
КонецПроцедуры
//_Паганини#Удержания

//ПодольскийАИ #УчетПроектов 25.11.2020 {
Процедура РаспределитьОстаткиСотрудникиПоПроектам()
	
	ТабЧастьСотрудники = ЭтотОбъект.Сотрудники.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.Сотрудник,
	|	выбор 
	|		когда &СтруктурнаяЕдиница = Значение(Справочник.СтруктурныеЕдиницы.ПустаяСсылка) 
	|			тогда Таблица.СтруктурнаяЕдиница 
	|			иначе &СтруктурнаяЕдиница 
	|	конец как СтруктурнаяЕдиница, //Малышев 2025-02-12 ONESOFT-3849
	|	Таблица.СуммаПлатежа КАК СуммаПлатежа,
	|	Таблица.СуммаРасчетов КАК СуммаРасчетов,
	|	Таблица.ВидУдержанияНДФЛ КАК ВидУдержанияНДФЛ,
	|	Таблица.НДФЛПлатежа КАК НДФЛПлатежа,
	|	Таблица.ВидУдержанияПФ КАК ВидУдержанияПФ,
	|	Таблица.СуммаПФПлатежа КАК СуммаПФПлатежа,
	|	Таблица.СуммаЛгот КАК СуммаЛгот
	|ПОМЕСТИТЬ ДокТЧ
	|ИЗ
	|	&ТаблицаДокумента КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.Сотрудник КАК Сотрудник,
	|	Таблица.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница, //Малышев 2025-02-12 ONESOFT-3849
	|	Таблица.СуммаПлатежа КАК СуммаПлатежа,
	|	Таблица.СуммаРасчетов КАК СуммаРасчетов,
	|	Таблица.ВидУдержанияНДФЛ КАК ВидУдержанияНДФЛ,
	|	Таблица.НДФЛПлатежа КАК НДФЛПлатежа,
	|	Таблица.ВидУдержанияПФ КАК ВидУдержанияПФ,
	|	Таблица.СуммаПФПлатежа КАК СуммаПФПлатежа,
	|	Таблица.СуммаЛгот КАК СуммаЛгот,
	|	РасчетыСПерсоналомОстатки.Проект КАК Проект,
	|	СУММА(ВЫБОР
	|			КОГДА &ВалютаРасчетов = &ВалютаДокумента
	|				ТОГДА РасчетыСПерсоналомОстатки.СуммаВалОстаток
	|			ИНАЧЕ ВЫРАЗИТЬ(РасчетыСПерсоналомОстатки.СуммаВалОстаток * &Курс * КурсыВалютыДокумента.Кратность / КурсыВалютыДокумента.Курс * &Кратность КАК ЧИСЛО(15, 2))
	|		КОНЕЦ) КАК СуммаПлатежаПоПроекту,
	|	СУММА(ЕСТЬNULL(РасчетыСПерсоналомОстатки.СуммаОстаток, 0)) КАК СуммаРасчетовПоПроекту
	|ИЗ
	|	ДокТЧ КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПерсоналом.Остатки(
	|				,
	|				Организация = &Организация
	|					И ПериодРегистрации = &ПериодРегистрации
	|					И Валюта = &ВалютаРасчетов
	//|					И СтруктурнаяЕдиница = &СтруктурнаяЕдиница  
	|					И (&СтруктурнаяЕдиница = Значение(Справочник.СтруктурныеЕдиницы.ПустаяСсылка) 
	|						или СтруктурнаяЕдиница = &СтруктурнаяЕдиница)	//Малышев 2025-02-12 ONESOFT-3849
	|			) КАК РасчетыСПерсоналомОстатки
	//|		ПО Таблица.Сотрудник = РасчетыСПерсоналомОстатки.Сотрудник ,
	|		ПО Таблица.Сотрудник = РасчетыСПерсоналомОстатки.Сотрудник и Таблица.СтруктурнаяЕдиница = РасчетыСПерсоналомОстатки.СтруктурнаяЕдиница,
	|	РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &ВалютаДокумента) КАК КурсыВалютыДокумента
	|ГДЕ
	|	РасчетыСПерсоналомОстатки.СуммаВалОстаток > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Таблица.Сотрудник,
	|	Таблица.СтруктурнаяЕдиница, //Малышев 2025-02-12 ONESOFT-3849
	|	Таблица.СуммаПлатежа,
	|	Таблица.СуммаРасчетов,
	|	Таблица.ВидУдержанияНДФЛ,
	|	Таблица.НДФЛПлатежа,
	|	Таблица.ВидУдержанияПФ,
	|	Таблица.СуммаПФПлатежа,
	|	Таблица.СуммаЛгот,
	|	РасчетыСПерсоналомОстатки.Проект
	|ИТОГИ
	|	МАКСИМУМ(СуммаПлатежа),
	|	МАКСИМУМ(СуммаРасчетов),
	|	МАКСИМУМ(НДФЛПлатежа),
	|	МАКСИМУМ(СуммаПФПлатежа),
	|	МАКСИМУМ(СуммаЛгот),
	|	СУММА(СуммаПлатежаПоПроекту),
	|	СУММА(СуммаРасчетовПоПроекту)
	|ПО
	|	Сотрудник,
	|	СтруктурнаяЕдиница, //Малышев 2025-02-12 ONESOFT-3849
	|	ВидУдержанияНДФЛ,
	|	ВидУдержанияПФ";
	
	Запрос.УстановитьПараметр("ТаблицаДокумента",	ТабЧастьСотрудники);
	Запрос.УстановитьПараметр("ПериодРегистрации", 	ПериодРегистрации);
	Запрос.УстановитьПараметр("Организация", 		УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация));
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ВалютаРасчетов",		ВалютаРасчетов);
	Запрос.УстановитьПараметр("ВалютаДокумента",	ВалютаДокумента);
	Запрос.УстановитьПараметр("Курс",				Курс);
	Запрос.УстановитьПараметр("Кратность",			Кратность);
	Запрос.УстановитьПараметр("КонецМесяца", 		КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("Дата", 				Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.Сотрудники.Очистить();
	
	ВыборкаСотрудник = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСотрудник.Следующий() Цикл
		//Малышев (--  2025-02-12 ONESOFT-3849
		ВыборкаСтруктурнаяЕдиница = ВыборкаСотрудник.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	    Пока ВыборкаСтруктурнаяЕдиница.Следующий() Цикл
		
		//ВыборкаНДФЛ = ВыборкаСотрудник.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВыборкаНДФЛ = ВыборкаСтруктурнаяЕдиница.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		//Малышев --)
		Пока ВыборкаНДФЛ.Следующий() Цикл
			
			ВыборкаПФ = ВыборкаНДФЛ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПФ.Следующий() Цикл
				
				ОсталосьСуммаРасчетов = ВыборкаПФ.СуммаРасчетов;
				ОсталосьНДФЛПлатежа = ВыборкаПФ.НДФЛПлатежа;
				ОсталосьСуммаПФПлатежа = ВыборкаПФ.СуммаПФПлатежа;
				ОсталосьСуммаЛгот = ВыборкаПФ.СуммаЛгот;
				
				ДобавленаСтрока = Ложь;
				ВыборкаДет = ВыборкаПФ.Выбрать();
				Пока ВыборкаДет.Следующий() Цикл
					СтрокаСотрудник = ЭтотОбъект.Сотрудники.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаСотрудник, ВыборкаДет);
					
					Коэффициент = 0;
					Если ВыборкаПФ.СуммаПлатежа <> 0 Тогда
						Коэффициент = ВыборкаДет.СуммаПлатежаПоПроекту / СтрокаСотрудник.СуммаПлатежа;
					КонецЕсли;
					
					СтрокаСотрудник.СуммаПлатежа = ВыборкаДет.СуммаПлатежаПоПроекту;
					СтрокаСотрудник.СуммаРасчетов = ВыборкаДет.СуммаРасчетовПоПроекту;
					
					СтрокаСотрудник.НДФЛПлатежа = Окр(СтрокаСотрудник.НДФЛПлатежа * Коэффициент, 2);
					СтрокаСотрудник.СуммаПФПлатежа = Окр(СтрокаСотрудник.СуммаПФПлатежа * Коэффициент, 2);
					СтрокаСотрудник.СуммаЛгот = Окр(СтрокаСотрудник.СуммаЛгот * Коэффициент, 2);
					
					ОсталосьСуммаРасчетов = ОсталосьСуммаРасчетов - СтрокаСотрудник.СуммаПлатежа;
					ОсталосьНДФЛПлатежа = ОсталосьНДФЛПлатежа - СтрокаСотрудник.НДФЛПлатежа;
					ОсталосьСуммаПФПлатежа = ОсталосьСуммаПФПлатежа - СтрокаСотрудник.СуммаПФПлатежа;
					ОсталосьСуммаЛгот = ОсталосьСуммаЛгот - СтрокаСотрудник.СуммаЛгот;
					
					ДобавленаСтрока = Истина;
				КонецЦикла;
				
				Если ДобавленаСтрока Тогда
					Если ОсталосьСуммаРасчетов <> 0 Тогда
						СтрокаСотрудник.СуммаРасчетов = СтрокаСотрудник.СуммаРасчетов + ОсталосьСуммаРасчетов;
					КонецЕсли;
					Если ОсталосьНДФЛПлатежа <> 0 Тогда
						СтрокаСотрудник.НДФЛПлатежа = СтрокаСотрудник.НДФЛПлатежа + ОсталосьНДФЛПлатежа;
					КонецЕсли;
					Если ОсталосьСуммаПФПлатежа <> 0 Тогда
						СтрокаСотрудник.СуммаПФПлатежа = СтрокаСотрудник.СуммаПФПлатежа + ОсталосьСуммаПФПлатежа;
					КонецЕсли;
					Если ОсталосьСуммаЛгот <> 0 Тогда
						СтрокаСотрудник.СуммаЛгот = СтрокаСотрудник.СуммаЛгот + ОсталосьСуммаЛгот;
					КонецЕсли;
					ДобавленаСтрока = Ложь;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		КонецЦикла; //СтруктурнаяЕдиница
	КонецЦикла;
	
КонецПроцедуры
//ПодольскийАИ #УчетПроектов 25.11.2020 } 

Процедура РасчитатьСуммы_ПФ_НДФЛ(ТекСтрока)
	
	СтавкаНДФЛ	= 0;
	СтавкаПФ	= 0;
	
	Если ЗначениеЗаполнено(ТекСтрока.ВидУдержанияНДФЛ) Тогда
		СтавкаНДФЛ = ТекСтрока.ВидУдержанияНДФЛ.СтавкаНДФЛ;
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекСтрока.ВидУдержанияПФ) Тогда
		СтавкаПФ = ТекСтрока.ВидУдержанияПФ.СтавкаПФ;
	КонецЕсли;
	//Малышев 2025-02-12  ONESOFT-3849
	//СтрукОтвета = ПолучитьСуммоНалоговыхЛгот(Организация,ТекСтрока.Сотрудник,СтруктурнаяЕдиница,ПериодРегистрации);
	Если ЗначениеЗаполнено(ТекСтрока.СтруктурнаяЕдиница) Тогда
		СтрукОтвета = ПолучитьСуммоНалоговыхЛгот(Организация,ТекСтрока.Сотрудник,ТекСтрока.СтруктурнаяЕдиница,ПериодРегистрации);
	Иначе     
		СтрукОтвета = ПолучитьСуммоНалоговыхЛгот(Организация,ТекСтрока.Сотрудник,СтруктурнаяЕдиница,ПериодРегистрации);
	КонецЕсли;	
	
	СуммаЛгот = СтрукОтвета.Сумма;
	ПроцентПодоходного = СтрукОтвета.ПроцентПодоходного;
	СуммаПлатежа = ТекСтрока.СуммаПлатежа;
	СтавкаЛгот = СтавкаНДФЛ-ПроцентПодоходного;
	
	Если СтавкаЛгот < 0 Тогда
		СтавкаЛгот = 0
	КонецЕсли;	
	
	НДФЛЛгот = СуммаЛгот * (СтавкаЛгот/100);	
	НэтЛгот = СуммаЛгот - НДФЛЛгот;
	
	Если НэтЛгот >= СуммаПлатежа Тогда	
		
		Если СуммаПлатежа/((100-СтавкаЛгот)/100) < СуммаЛгот Тогда
			СуммаДляНалогов = 0;
			СуммаЛгот = СуммаПлатежа/((100-СтавкаЛгот)/100); 
		Иначе
			СуммаДляНалогов = Окр(СуммаПлатежа /((100-СтавкаЛгот)/100),2) - СуммаЛгот;
			СуммаЛгот = СуммаЛгот;
		КонецЕсли;	
		
		НДФЛБезЛгот = Окр((СуммаДляНалогов) /((100-СтавкаНДФЛ)/100), 2) - СуммаДляНалогов;
		НДФЛЛгот    = Окр((СуммаЛгот) - СуммаЛгот*((100-СтавкаЛгот)/100),2);
		
	Иначе		
		НДФЛБезЛгот = Окр((СуммаПлатежа - НэтЛгот)/((100-СтавкаНДФЛ)/100) - (СуммаПлатежа - НэтЛгот),2);			
	КонецЕсли;	
		
		
	ТекСтрока.НДФЛПлатежа		= НДФЛБезЛгот + НДФЛЛгот;
	ТекСтрока.СуммаЛгот = СуммаЛгот;
	ТекСтрока.СуммаПФПлатежа	= Окр((ТекСтрока.СуммаПлатежа + ТекСтрока.НДФЛПлатежа) * СтавкаПФ/(100 - СтавкаПФ), 2);
	
КонецПроцедуры   

Функция ПолучитьСуммоНалоговыхЛгот(Организация,Сотрудник,Подразделение,Дата) 
	
	СтрукОтвета = Новый Структура;
	СтрукОтвета.Вставить("Сумма",0);
	СтрукОтвета.Вставить("ПроцентПодоходного",20);
	
	Если ВидОперации = Перечисления.ВидыОперацийПлатежнаяВедомость.Аванс Тогда
		СтрукОтвета = РС_ОбщегоНазначения.ПолучитьСуммоНалоговыхЛгот(Организация,Сотрудник,Подразделение,Дата+1);
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	НалоговыеЛготыОстатки.Сотрудник,
	               |	НалоговыеЛготыОстатки.СуммаОстаток КАК Сумма,
	               |	НалоговыеЛготыОстатки.Организация,
	               |	НалоговыеЛготыОстатки.Подразделение,
	               |	НалоговыеЛготыИнформацияСрезПоследних.ПроцентПодоходного
	               |ИЗ
	               |	РегистрНакопления.НалоговыеЛготы.Остатки(
	               |			&Дата,
	               |			Организация = &Организация
	               |				И Подразделение = &Подразделение
	               |				И Сотрудник = &Сотрудник
	               |				И ТипЛгот = &ТипЛгот) КАК НалоговыеЛготыОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалоговыеЛготыИнформация.СрезПоследних КАК НалоговыеЛготыИнформацияСрезПоследних
	               |		ПО НалоговыеЛготыОстатки.Организация = НалоговыеЛготыИнформацияСрезПоследних.Организация
	               |			И НалоговыеЛготыОстатки.Сотрудник = НалоговыеЛготыИнформацияСрезПоследних.Сотрудник
	               |			И НалоговыеЛготыОстатки.Подразделение = НалоговыеЛготыИнформацияСрезПоследних.Подразделение";
	
	
	
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	Запрос.УстановитьПараметр("Сотрудник",Сотрудник);
	Запрос.УстановитьПараметр("Дата",Дата+1);
	Запрос.УстановитьПараметр("Организация",Организация);	
	
	Если ВидОперации = Перечисления.ВидыОперацийПлатежнаяВедомость.УдержаниеДляКонтрагента Тогда
		Запрос.УстановитьПараметр("ТипЛгот",Перечисления.ТипЛгот.УдержаниеДляКонтрагента);
	Иначе
		Запрос.УстановитьПараметр("ТипЛгот",Перечисления.ТипЛгот.Прочее);
	КонецЕсли;
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтрукОтвета.Сумма = СтрукОтвета.Сумма + Выборка.Сумма;
		СтрукОтвета.ПроцентПодоходного = Выборка.ПроцентПодоходного;
	КонецЕсли; 
	
	Возврат СтрукОтвета;
	
КонецФункции
//ПодольскийАИ #УчетПроектов 25.11.2020 }
